Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_pm.h
/* -------- PM_IDR : (PM Offset: 0x0C4) ( /W 32) Interrupt Disable Register -------- */
#define PM_IDR_OFFSET               0x0C4        /**< \brief (PM_IDR offset) Interrupt Disable Register */
#define PM_IDR_RESETVALUE           0x00000000   /**< \brief (PM_IDR reset_value) Interrupt Disable Register */

#define PM_IDR_CFD_Pos              0            /**< \brief (PM_IDR) Clock Failure Detected Interrupt Disable */
#define PM_IDR_CFD                  (0x1u << PM_IDR_CFD_Pos)
#define PM_IDR_CKRDY_Pos            5            /**< \brief (PM_IDR) Clock Ready Interrupt Disable */
#define PM_IDR_CKRDY                (0x1u << PM_IDR_CKRDY_Pos)
#define PM_IDR_WAKE_Pos             8            /**< \brief (PM_IDR) Wake up Interrupt Disable */
#define PM_IDR_WAKE                 (0x1u << PM_IDR_WAKE_Pos)
#define   PM_IDR_WAKE_0             (0x0u <<  8) /**< \brief (PM_IDR) No effect */
#define   PM_IDR_WAKE_1             (0x1u <<  8) /**< \brief (PM_IDR) Disable Interrupt. */
#define PM_IDR_AE_Pos               31           /**< \brief (PM_IDR) Access Error Interrupt Disable */
#define PM_IDR_AE                   (0x1u << PM_IDR_AE_Pos)
#define PM_IDR_MASK                 0x80000121u  /**< \brief (PM_IDR) MASK Register */

/* -------- PM_IMR : (PM Offset: 0x0C8) (R/  32) Interrupt Mask Register -------- */
#define PM_IMR_OFFSET               0x0C8        /**< \brief (PM_IMR offset) Interrupt Mask Register */
#define PM_IMR_RESETVALUE           0x00000000   /**< \brief (PM_IMR reset_value) Interrupt Mask Register */

#define PM_IMR_CFD_Pos              0            /**< \brief (PM_IMR) Clock Failure Detected Interrupt Mask */
#define PM_IMR_CFD                  (0x1u << PM_IMR_CFD_Pos)
#define PM_IMR_CKRDY_Pos            5            /**< \brief (PM_IMR) Clock Ready Interrupt Mask */
#define PM_IMR_CKRDY                (0x1u << PM_IMR_CKRDY_Pos)
#define PM_IMR_WAKE_Pos             8            /**< \brief (PM_IMR) Wake up Interrupt Mask */
#define PM_IMR_WAKE                 (0x1u << PM_IMR_WAKE_Pos)
#define   PM_IMR_WAKE_0             (0x0u <<  8) /**< \brief (PM_IMR) No effect */
#define   PM_IMR_WAKE_1             (0x1u <<  8) /**< \brief (PM_IMR) Disable Interrupt. */
#define PM_IMR_AE_Pos               31           /**< \brief (PM_IMR) Access Error Interrupt Mask */
#define PM_IMR_AE                   (0x1u << PM_IMR_AE_Pos)
#define PM_IMR_MASK                 0x80000121u  /**< \brief (PM_IMR) MASK Register */

/* -------- PM_ISR : (PM Offset: 0x0CC) (R/  32) Interrupt Status Register -------- */
#define PM_ISR_OFFSET               0x0CC        /**< \brief (PM_ISR offset) Interrupt Status Register */
#define PM_ISR_RESETVALUE           0x00000000   /**< \brief (PM_ISR reset_value) Interrupt Status Register */

#define PM_ISR_CFD_Pos              0            /**< \brief (PM_ISR) Clock Failure Detected Interrupt Status */
#define PM_ISR_CFD                  (0x1u << PM_ISR_CFD_Pos)
#define PM_ISR_CKRDY_Pos            5            /**< \brief (PM_ISR) Clock Ready Interrupt Status */
#define PM_ISR_CKRDY                (0x1u << PM_ISR_CKRDY_Pos)
#define PM_ISR_WAKE_Pos             8            /**< \brief (PM_ISR) Wake up Interrupt Status */
#define PM_ISR_WAKE                 (0x1u << PM_ISR_WAKE_Pos)
#define   PM_ISR_WAKE_0             (0x0u <<  8) /**< \brief (PM_ISR) No effect */
#define   PM_ISR_WAKE_1             (0x1u <<  8) /**< \brief (PM_ISR) Disable Interrupt. */
#define PM_ISR_AE_Pos               31           /**< \brief (PM_ISR) Access Error Interrupt Status */
#define PM_ISR_AE                   (0x1u << PM_ISR_AE_Pos)
#define PM_ISR_MASK                 0x80000121u  /**< \brief (PM_ISR) MASK Register */

/* -------- PM_ICR : (PM Offset: 0x0D0) ( /W 32) Interrupt Clear Register -------- */
#define PM_ICR_OFFSET               0x0D0        /**< \brief (PM_ICR offset) Interrupt Clear Register */
#define PM_ICR_RESETVALUE           0x00000000   /**< \brief (PM_ICR reset_value) Interrupt Clear Register */

#define PM_ICR_CFD_Pos              0            /**< \brief (PM_ICR) Clock Failure Detected Interrupt Status Clear */
#define PM_ICR_CFD                  (0x1u << PM_ICR_CFD_Pos)
#define PM_ICR_CKRDY_Pos            5            /**< \brief (PM_ICR) Clock Ready Interrupt Status Clear */
#define PM_ICR_CKRDY                (0x1u << PM_ICR_CKRDY_Pos)
#define PM_ICR_WAKE_Pos             8            /**< \brief (PM_ICR) Wake up Interrupt Status Clear */
#define PM_ICR_WAKE                 (0x1u << PM_ICR_WAKE_Pos)
#define PM_ICR_AE_Pos               31           /**< \brief (PM_ICR) Access Error Interrupt Status Clear */
#define PM_ICR_AE                   (0x1u << PM_ICR_AE_Pos)
#define PM_ICR_MASK                 0x80000121u  /**< \brief (PM_ICR) MASK Register */

/* -------- PM_SR : (PM Offset: 0x0D4) (R/  32) Status Register -------- */
#define PM_SR_OFFSET                0x0D4        /**< \brief (PM_SR offset) Status Register */
#define PM_SR_RESETVALUE            0x00000000   /**< \brief (PM_SR reset_value) Status Register */

#define PM_SR_CFD_Pos               0            /**< \brief (PM_SR) Clock Failure Detected */
#define PM_SR_CFD                   (0x1u << PM_SR_CFD_Pos)
#define PM_SR_OCP_Pos               1            /**< \brief (PM_SR) Over Clock Detected */
#define PM_SR_OCP                   (0x1u << PM_SR_OCP_Pos)
#define PM_SR_CKRDY_Pos             5            /**< \brief (PM_SR) Clock Ready */
#define PM_SR_CKRDY                 (0x1u << PM_SR_CKRDY_Pos)
#define PM_SR_WAKE_Pos              8            /**< \brief (PM_SR) Wake up */
#define PM_SR_WAKE                  (0x1u << PM_SR_WAKE_Pos)
#define   PM_SR_WAKE_0              (0x0u <<  8) /**< \brief (PM_SR) No effect */
#define   PM_SR_WAKE_1              (0x1u <<  8) /**< \brief (PM_SR) Disable Interrupt. */
#define PM_SR_PERRDY_Pos            28           /**< \brief (PM_SR) Peripheral Ready */
#define PM_SR_PERRDY                (0x1u << PM_SR_PERRDY_Pos)
#define PM_SR_AE_Pos                31           /**< \brief (PM_SR) Access Error */
#define PM_SR_AE                    (0x1u << PM_SR_AE_Pos)
#define PM_SR_MASK                  0x90000123u  /**< \brief (PM_SR) MASK Register */

/* -------- PM_PPCR : (PM Offset: 0x160) (R/W 32) Peripheral Power Control Register -------- */
#define PM_PPCR_OFFSET              0x160        /**< \brief (PM_PPCR offset) Peripheral Power Control Register */
#define PM_PPCR_RESETVALUE          0x000001FE   /**< \brief (PM_PPCR reset_value) Peripheral Power Control Register */

